# 중요! 이 줄이 없으면, ~/Applications에 설치하므로 꼭 넣어야 한다.
cask_args appdir: '/Applications'

###################################################
 Taps
###################################################
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jakehilborn/jakehilborn"    # displayplacer 사용
tap "theeternalsw0rd/telnet"     # telnet 사용
tap "homebrew/services"
tap 'homebrew/dupes'    # 맥에 기본 설치된 툴을 대체하기 위한 Tap (e.g. nano 등)


###################################################
 Install with brew
###################################################

# Libraies
brew "zsh"
brew "zsh-syntax-highlighting"
# brew "zsh-completions" # zsh 자동완성을 위한 데이터 수집 플러그인. 기여하고 싶다면 활성화.
brew "mas"
brew "tree"
brew "mackup"
brew "glib"
brew "wget"
brew "libtool"
brew "graphviz"

# plugin
brew "autojump"
brew "cairo"
brew "expect"
brew "fasd"
brew "fzf"
brew "gcc"
brew "gh"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "neofetch"

# dev
brew "maven"
brew "gradle"
brew "git"
brew "git-lts"
brew "jenv"
brew "awscli"
brew "openjdk@11"
brew "pyenv"
brew "ruby"
brew "node"
brew "telnet"
brew "tomcat@8"
brew "python@3.9"

# application
brew "vim"
brew "snappy"
brew "jakehilborn/jakehilborn/displayplacer"

###################################################
 Install with cask
###################################################

# system
cask "coconutbattery"
cask "karabiner-elements"
cask "keka"
cask "fluor"
cask "appcleaner"
cask "gureumkim"        # 구름입력기: 맥의 불편한 한글입력완성도때문에 설치. 마지막단어 사람짐 이슈등을 해결.

# Menubar
cask "itsycal"
cask "vanilla"

# productivity
cask "alfred"
cask "rectangle"
cask "cheatsheet"
cask "hotkeyEVE"
cask "xmind"
cask "pomodone"

# dev
cask "postman"
cask "intellij-idea"
# cask "gitkraken"
cask "docker"
cask "gas-mask"
cask "iterm2"
cask "visual-studio-code"
cask "cyberduck"
# cask "wireshark"
cask "drawio"
cask "adoptopenjdk8"
cask "java11"

# docs
cask "atom"
cask "boostnote"
cask "microsoft-office"
cask "evernote"
cask "notion"

# messenger
cask "slack"

# browser
cask "whale"
cask "google-chrome"

# utility
cask "numi"
cask "vlc"
cask "skitch"

# cloud
# cask "onedrive"
# cask "dropbox"
# cask "google-drive-file-stream"      # G-suite 계정에서 사용. 회사나 학생 계정있으면 사용가능
cask "google-backup-and-sync"        # 일반적인 google-drive. 구글드라이브의 파일을 로컬 폴더에 동기화함.
cask "adobe-creative-cloud"

# macOS Finder Quick Look plugins
## - https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "betterzip"
cask "qlimagesize"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"
# cask "provisionql"
# cask "quicklookapk"
# cask "quicklook-pat"

# fonts
cask 'font-d2coding'
cask 'font-hack'
cask "font-hack-nerd-font"
cask "font-mononoki-nerd-font"
cask 'font-meslo-lg'
cask 'font-meslo-for-powerline'
cask 'font-nanumgothic'
cask 'font-nanummyeongjo'
cask 'font-fontawesome'
cask 'font-awesome-terminal-fonts'


###################################################
 Install with mas
###################################################
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "PomoDone App", id: 1096128050
mas "Snappy", id: 512617038
mas "Todoist", id: 585829637
mas "카카오톡", id: 869223134
mas "한컴오피스 한글 2014 VP 뷰어", id: 416746898
# mas "KakaoTalk", id: 869223134
# mas "Hancom Office HWP 2014 VP Viewer", id: 416746898
# mas "Microsoft Remote Desktop", id: 715768417
